<a href="https://colab.research.google.com/github/RupeshRavaindranath/python-for-data-science-and-machine-learning-essential-training-part-1-3006708/blob/main/notebooks/02_03e.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

## Data Filtering and Selection

### Common DataFrame Operations

#### Selecting Columns

In [ ]:
display(numbers_df['column 1'].head())
display(numbers_df[['column 1', 'column 3']].head())

#### Adding a New Column

In [ ]:
numbers_df['new_column'] = numbers_df['column 1'] + numbers_df['column 2']
display(numbers_df.head())

#### Dropping a Column

In [ ]:
numbers_df_dropped = numbers_df.drop('new_column', axis=1)
display(numbers_df_dropped.head())

#### Descriptive Statistics

In [ ]:
display(numbers_df.describe())

#### Getting unique values from a column

In [ ]:
print(numbers_df['column 1'].unique())

#### Getting value counts for a column

In [ ]:
print(numbers_df['column 2'].value_counts())

In [ ]:
pip install pandas

Requirement already satisfied: pandas in /home/codespace/.local/lib/python3.10/site-packages (2.1.3)
Requirement already satisfied: numpy<2,>=1.22.4 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (1.26.2)
Requirement already satisfied: python-dateutil>=2.8.2 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (2023.3.post1)
Requirement already satisfied: tzdata>=2022.1 in /home/codespace/.local/lib/python3.10/site-packages (from pandas) (2023.3)
Requirement already satisfied: six>=1.5 in /home/codespace/.local/lib/python3.10/site-packages (from python-dateutil>=2.8.2->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [ ]:
import numpy as np
import pandas as pd

from pandas import DataFrame

In [ ]:
numbers_df = DataFrame(np.arange(0,90,3).reshape(10,3), index = ['row 1','row 2','row 3','row 4','row 5','row 6','row 7','row 8','row 9','row 10'],
columns = ['column 1','column 2','column 3'])

numbers_df

        column 1  column 2  column 3
row 1          0         3         6
row 2          9        12        15
row 3         18        21        24
row 4         27        30        33
row 5         36        39        42
row 6         45        48        51
row 7         54        57        60
row 8         63        66        69
row 9         72        75        78
row 10        81        84        87

In [ ]:
numbers_df.iloc[0,1]

3

In [ ]:
numbers_df.iloc[0,1] = 20
numbers_df

        column 1  column 2  column 3
row 1          0        20         6
row 2          9        12        15
row 3         18        21        24
row 4         27        30        33
row 5         36        39        42
row 6         45        48        51
row 7         54        57        60
row 8         63        66        69
row 9         72        75        78
row 10        81        84        87

In [ ]:
numbers_df.iloc[[1,2,4],[1,2]]

       column 2  column 3
row 2        12        15
row 3        21        24
row 5        39        42

### Comparison operators (> < = <= => == !=) and Masking.

In [ ]:
mask = numbers_df > 30
mask

        column 1  column 2  column 3
row 1      False     False     False
row 2      False     False     False
row 3      False     False     False
row 4      False     False      True
row 5       True      True      True
row 6       True      True      True
row 7       True      True      True
row 8       True      True      True
row 9       True      True      True
row 10      True      True      True

In [ ]:
numbers_df[mask]

        column 1  column 2  column 3
row 1        NaN       NaN       NaN
row 2        NaN       NaN       NaN
row 3        NaN       NaN       NaN
row 4        NaN       NaN      33.0
row 5       36.0      39.0      42.0
row 6       45.0      48.0      51.0
row 7       54.0      57.0      60.0
row 8       63.0      66.0      69.0
row 9       72.0      75.0      78.0
row 10      81.0      84.0      87.0

In [ ]:
numbers_df[numbers_df>30] = 0
numbers_df

        column 1  column 2  column 3
row 1          0        20         6
row 2          9        12        15
row 3         18        21        24
row 4         27        30         0
row 5          0         0         0
row 6          0         0         0
row 7          0         0         0
row 8          0         0         0
row 9          0         0         0
row 10         0         0         0

In [ ]:
numbers_df.iloc[2:6,1:3]

       column 2  column 3
row 3        21        24
row 4        30         0
row 5         0         0
row 6         0         0